case2-checkingLagrangianCellThreshold/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        //type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
        type            zeroGradient;
    }
    lowerWall
    {
        type            noSlip;
    }
    backWall
    {
        type            noSlip;
    }
    frontWall
    {
        type            noSlip;
    }
    topWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
