case2-checkingLagrangianCellThreshold/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 1 0)
    (0 1 0)

    (0 0 1)
    (3 0 1)
    (3 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    backWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    frontWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
